{
  "news": [
    {
      "id": "news_1",
      "title": "CSE Index Reaches All-Time High",
      "source": "CSE Official",
      "publishedDate": "2025-12-26",
      "summary": "The Colombo Stock Exchange Index surged to record levels today, driven by strong banking and energy sector performance.",
      "tags": ["CSE", "Economy"],
      "content": "The Colombo Stock Exchange Index has reached unprecedented heights today, driven by robust performance across multiple sectors. Banking institutions led the charge with strong earnings reports, while the energy sector benefited from improved global market conditions. Analysts attribute this growth to increased foreign investor interest and positive macroeconomic indicators."
    },
    {
      "id": "news_2",
      "title": "Tech Sector Booms as Digital Transformation Accelerates",
      "source": "Investment Weekly",
      "publishedDate": "2025-12-25",
      "summary": "Technology companies listed on CSE show strong growth as businesses accelerate digital transformation initiatives.",
      "tags": ["Company", "Technology"],
      "content": "Technology companies listed on the Colombo Stock Exchange are experiencing strong growth as enterprises adopt cloud computing, cybersecurity, and automation solutions. Several listed firms announced expansion plans and increased hiring."
    },
    {
      "id": "news_3",
      "title": "Global Markets Rally on Positive Economic Data",
      "source": "Global Market News",
      "publishedDate": "2025-12-24",
      "summary": "International stock markets surge following release of positive economic indicators from major economies.",
      "tags": ["Global Markets", "Economy"],
      "content": "Global markets rallied following strong employment and inflation data from major economies. Emerging markets, including Sri Lanka, benefited from increased investor risk appetite."
    },
    {
      "id": "news_4",
      "title": "Banking Sector Reports Strong Q3 Results",
      "source": "Financial Times",
      "publishedDate": "2025-12-23",
      "summary": "Major banks announce excellent quarterly results with increased profitability.",
      "tags": ["Company", "CSE"],
      "content": "Major listed banks reported improved profitability for Q3, supported by higher net interest income and stable asset quality."
    },

    {
      "id": "news_impact_001",
      "title": "Moody’s Places Sampath Bank Ratings on Review for Possible Downgrade",
      "source": "CSE Official",
      "publishedDate": "2025-01-15",
      "summary": "Moody’s Investors Service placed Sampath Bank PLC ratings under review for downgrade.",
      "tags": ["Company", "CSE", "Banking"],
      "content": "Moody’s Investors Service announced that it has placed Sampath Bank PLC’s long-term issuer ratings under review for possible downgrade. The decision reflects macroeconomic pressures, sovereign risk exposure, and concerns over asset quality. Market participants reacted cautiously following the announcement."
    },
    {
      "id": "news_impact_002",
      "title": "Commercial Bank Reports Sharp Decline in Quarterly Profits",
      "source": "Daily FT",
      "publishedDate": "2025-01-10",
      "summary": "Commercial Bank of Ceylon PLC reported a sharp drop in quarterly earnings.",
      "tags": ["Company", "CSE", "Earnings"],
      "content": "Commercial Bank of Ceylon PLC reported a sharp decline in quarterly profits due to higher loan loss provisions and margin compression. Analysts noted that results fell below expectations, triggering negative sentiment among investors."
    },
    {
      "id": "news_impact_003",
      "title": "Central Bank Tightens Capital Requirements for Listed Banks",
      "source": "Business Times",
      "publishedDate": "2025-01-05",
      "summary": "New capital rules could pressure banking sector balance sheets.",
      "tags": ["CSE", "Banking", "Regulation"],
      "content": "The Central Bank of Sri Lanka introduced tighter capital adequacy requirements for licensed commercial banks. Analysts warned that higher capital buffers may restrict dividend payouts and weigh on short-term profitability."
    },
    {
      "id": "news_impact_004",
      "title": "Sampath Bank Posts Strong Earnings Growth Driven by Digital Expansion",
      "source": "Investment Weekly",
      "publishedDate": "2024-12-20",
      "summary": "Sampath Bank reports better-than-expected earnings growth.",
      "tags": ["Company", "CSE", "Earnings"],
      "content": "Sampath Bank PLC reported stronger-than-expected quarterly earnings supported by digital banking growth and cost optimization. Investor sentiment improved following the announcement."
    }
  ]
}
